karlp/kgarden3/boards/ESP32_CUSTOM/mpconfigboard.h

#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME "lol CUSTOM ESP32 module"
#endif

#ifndef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME "ESP32"
#endif
